racewayVA01/CFD/constant/polyMesh/blockMeshDict_ori
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
	(3.443  0.340 -0.5)
	(3.443  0.060 -0.5)
	(3.443 -0.060 -0.5)
	(3.443 -0.328 -0.5)
	(5.944 -0.566 -0.5)
	(5.943 -0.060 -0.5)
	(5.943  0.060 -0.5)
	(5.942  0.586 -0.5)
	(3.443  0.060 -0.06)
	(3.443 -0.060 -0.06)
	(5.943 -0.060 -0.06)
	(5.943  0.060 -0.06)
	(3.443  0.060  0.06)
	(3.443 -0.060  0.06)
	(5.943 -0.060  0.06)
	(5.943  0.060  0.06)
	(3.443  0.340  0.746) 
    (3.443  0.060  0.746)
	(3.443 -0.060  0.746)
	(3.443 -0.328  0.746)
	(5.944 -0.566  0.746)
	(5.943 -0.060  0.746)
	(5.943  0.060  0.746)
	(5.942  0.586  0.746)
	(3.454  0.341  2.5)
	(3.455 -0.329  2.5)
	(6.650 -0.633  2.5)
	(6.648  0.655  2.5)
);

blocks
(
    hex ( 2  3  4  5 18 19 20 21) block0 (107 19 42) simpleGrading (1 1 1)
	hex ( 2  5  6  1  9 10 11  8) block1 (107 4 15) simpleGrading (1 1 1)
	hex ( 9 10 11  8 13 14 15 12) block2 (107 4 4) simpleGrading (1 1 1) //tuyere
	hex (13 14 15 12 18 21 22 17) block3 (107 4 23) simpleGrading (1 1 1)
	hex ( 1  6  7  0 17 22 23 16) block4 (107 20 42) simpleGrading (1 1 1)
	hex (19 20 23 16 25 26 27 24) block5 (107 43 58) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (     
			( 3  4 20 19)  //block0
			( 5 21 20  4)  //block0
			( 3 19 18  2)  //block0
			( 2  9  8  1)  //block1
			( 5  6 11 10)  //block1
			( 9 13 12  8)  //block2
			(13 18 17 12)  //block3
			(14 15 22 21)  //block3
			( 1 17 16  0)  //block4
			( 6  7 23 22)  //block4
			( 0 16 23  7)  //block4
            (19 25 24 16)  //block5
			(19 20 26 25)  //block5
			(20 23 27 26)  //block5
			(23 16 24 27)  //block5
        );
    }
    inlet
    {
        type patch;
        faces
        (
  			(10 11 15 14)  //block2
        );
    }

    bottom
    {
        type wall;
        faces
        (
  			( 3  2  5  4)  //block0
			( 2  1  6  5)  //block1
			( 1  0  7  6)  //block4
        );
    }

    top
    {
        type wall;
        faces
        (
  			(25 26 27 24)  //block5
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
