racewayVA01/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.0e5;

boundaryField
{
    top
    {
        type            fixedValue;
        value           uniform 1.0e5;
    }

    bottom
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            zeroGradient;
    }

    internal
    {
        type            zeroGradient;
        //type              zeroGradient;//symmetryPlane;
        //type            fixedValue;
        //value           uniform 1.0e5;
    }

    sides
    {
        type            zeroGradient;
        //type            symmetryPlane;
        //type            fixedValue;
        //value           uniform 1.0e5;
    }
    sink
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
