racewayVA01/CFD/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.1885; // 2.377;//

boundaryField
{
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }

    internal
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;//symmetryPlane;
    }
    sink
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
